## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rg_main_aks.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "accern-aks-prd-eus2-rg"
      + tags     = {
          + "Application" = "accern-aks"
          + "Environment" = "prod"
          + "ID"          = "00000001"
          + "Owner"       = "Javier.Gaibisso"
        }
    }

  # module.rg_main_network.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "accern-nwsvcs-prd-eus2-rg"
      + tags     = {
          + "Application" = "accern-aks"
          + "Environment" = "prod"
          + "ID"          = "00000001"
          + "Owner"       = "Javier.Gaibisso"
        }
    }

  # module.rg_main_shared.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "accern-shared-prd-eus2-rg"
      + tags     = {
          + "Application" = "accern-aks"
          + "Environment" = "prod"
          + "ID"          = "00000001"
          + "Owner"       = "Javier.Gaibisso"
        }
    }

  # module.vnet_main_network.azurerm_subnet.subnet["aks_snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.20.8.0/21",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "accern-nwsvcs-prd-eus2-snet-aks"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = "accern-nwsvcs-prd-eus2-vnet"
    }

  # module.vnet_main_network.azurerm_subnet.subnet["appgw_snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.20.0.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "accern-nwsvcs-prd-eus2-snet-appgw"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = "accern-nwsvcs-prd-eus2-vnet"
    }

  # module.vnet_main_network.azurerm_subnet.subnet["compute_snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.20.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "accern-nwsvcs-prd-eus2-snet-compute"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = "accern-nwsvcs-prd-eus2-vnet"
    }

  # module.vnet_main_network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.20.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "accern-nwsvcs-prd-eus2-vnet"
      + resource_group_name = "accern-nwsvcs-prd-eus2-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Application" = "accern-aks"
          + "Environment" = "prod"
          + "ID"          = "00000001"
          + "Owner"       = "Javier.Gaibisso"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```
</details>